{
  "minerals": [
    {
      "name": "Уголь",
      "description": "Используется в качестве топлива для разжигания огня в кузнице для изготовления предметов или оружия. Необходимое количество угля варьируется в зависимости от времени использования.",
      "image": "/minerals/coal.jpg"
    },
    {
      "name": "Бронза",
      "description": "Используется для изготовления простого оружия, предметов.",
      "image": "/minerals/copper.jpg"
    },
    {
      "name": "Железо",
      "description": "Используется для ковки предметов или оружия отличного качества, но не имеет преимуществ и может продаваться по средним ценам.",
      "image": "/minerals/iron.jpeg"
    }, 
    {
      "name": "Еремеевит",
      "description": "Используется в качестве декоративных вставок при изготовлении оружия или предметов, обладающих редкими и уникальными свойствами. Этот материал делает ваше оружие особенным, и очень дорогой.",
      "image": "/minerals/Jeremejevite.webp"
    },
    {
      "name": "Золото",
      "description": "Этот ценный металл увеличивает урон оружия, наносящего физический урон, на 15% (урон добавляется до применения других бафов).",
      "image": "/minerals/gold.webp"
    },
    {
      "name": "Алмаз",
      "description": "Увеличивает сопротивление предметов, которые вы используете, снижая вероятность их поломки, а если предмет связан с сопротивлением, это даст на 10 % больше бонуса к сопротивлению этого предмета.",
      "image": "/minerals/diamond.jpg"
    },
    {
      "name": "Рубин",
      "description": "Увеличивает урон оружия, наносящего магический урон, на 15% (до учета баффов).",
      "image": "/minerals/ruby.jpeg"
    },
    {
      "name": "Аметист",
      "description": "Увеличивает магические усиления, которые дает или получает ваш предмет, на 10% во время боя.",
      "image": "/minerals/ametist.jpg" 
    },
    {
      "name": "Сапфир",
      "description": "При размещении на оружии или предмете максимальное hp, человека, который  будет использовать оружие, будет увеличено на 10%.",
      "image": "/minerals/sapphire.png"
    },
    {
      "name": "Изумруд",
      "description": "При размещении на оружии вы получаете следующий эффект:Ваш максимальный запас маны увеличивается на 10%.",
      "image": "/minerals/diamond.jpg"
    },
    {
      "name": "Танзанит",
      "description": "Эта руда увеличивает физические усиления, которые ваш предмет или оружие дает или получает, на 10% во время использования предмета.",
      "image": "/minerals/tanzanite.jpg"
    }
  ]
}